{
    "jobs": [
      {
        "id": "VyxlLGIsICxELGUsdixlLGwsbyxwLGUscixMLEUsSSxELE8sUyxHLHIsZSxhLHQsICxGLGEsbCxsLHM=",
        "title": "Web Developer",
        "company": "LEIDOS",
        "description": "Description\n\nAt Leidos, everything we do is built on our commitment to do the right thing for our customers, our employees, and our communities. Our mission is to make the world safer, healthier, and more efficient through information technology, engineering, and science...\n\nLeidos National Security Sector is seeking a Web Developer to support an enterprise IT program. We are looking for a developer that has done coding in Java and Angular as well as WordPress/Talkabout when necessary for internal projects. The Web Developer will work across multiple applications providing new development and O&amp;M support. A successful candidate should be comfortable providing first line customer support from time to time to provide application support when needed.\n\nA current and active TS/SCI with Polygraph security clearance is required for this position. We do not have the ability to sponsor clearance processing for this role.\n\nPrimary Responsibilities\n\nThe client requires a Web Developer to join a team of three others to support to perform Operations and Maintenance (O&amp;M) and development activities for websites and applications developed by the client team. This includes assessments and consultations on the design of Java web tools, O&amp;M of existing applications, server management, and development of new applications. Applications reside in physical environments and the client's cloud environment. Client management shall set the priorities. The Web Developer shall:\n• Work closely with project manager, development team, information system security manager; however, the client project manager will manage the priorities.\n• Provide occasional on call duty as needed.\n• Assess and validate Software requirements across the client organization.\n• Provide architectural design and web development support to meet web application requirements.\n• Participate in software design discussions and recommend implementation of the tools, technologies and techniques.\n• Redesign the existing Web, Software or SharePoint applications to add new features, optimize, scale or improve stability and performance.\n• Create, manage, and maintain software systems in AWS.\n• Provide O&amp;M and content management support for client's Web, software and SharePoint Sites.\n• Work within Agile project management methodologies.\n\nBasic Qualifications\n• Active/current TS/SCI with Polygraph security clearance.\n• Availability for periodic overnight travel to southeastern Virginia.\n• Demonstrated experience developing, deploying, and maintaining software applications and systems.\n• Demonstrated experience identifying and validating requirements for SharePoint sites, Software or Web sites.\n• Demonstrated experience working in cloud AWS architecture.\n• Demonstrated experience adding new features, optimizing, scaling, or improving stability and performance of applications, SharePoint or Web.\n• Demonstrated experience using JavaScript (JS).\n• Java (e.g., Springboot, Maven, Apache), Typescript (e.g., Angular, NestJS, React, Vue), Javascript (NodeJS, Express, etc.), AWS Cloud Services (S3, RDS, SQS, Lambda, EC2, etc.), CI/CD familiarization, Linux proficiency.\n• Experience with MySQL or equivalent (Postgres, SQL), developing complex data models, optimizing queries, and using Object Relational Mapping (ORM) frameworks such as TypeORM for typescript.\n\nPreferred Qualifications\n• Demonstrated experience with software application development.\n• Demonstrated experience with Web development.\n• Demonstrated experience as a programming with HTML.\n• Demonstrated experience Java Spring/Spring boot.\n• Demonstrated experience with WordPress.\n• Demonstrated experience developing and administering Windows based applications.\n• Demonstrated experience developing and administering Linux applications.\n• Demonstrated experience with client's applications at this location, to include the visitor request system and student record management systems.\n• Demonstrated experience with SharePoint Administration.\n• UI/UX expertise, CSS frameworks (Material, Bootstrap, etc.)\n• Experience with caching systems such as Redis, Memcache.\n• Expert proficiency with software design patterns and best practices (singleton, decorator, decoupling, domain-driven).\n• Current project scope: Ground-up redesign and development of a full-stack web application using Angular and NestJS, along with RDS MySql, SE, EC2.\n• Self-starter, works under limited guidance and well with ambiguity.\n• Strong critical thinking skills, test-driven development, object-oriented solid development foundation.\n\nPay Range:\nPay Range $108,550.00 - $196,225.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.\n\n#Featuredjob\n\nOriginal Posting Date:\n01/17/2024\n\nWhile subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above",
        "image": "https://fonts.gstatic.com/s/i/googlematerialicons/auto_stories/v8/gm_grey-24dp/1x/gm_auto_stories_gm_grey_24dp.png",
        "location": "Great Falls, VA",
        "employmentType": "Full-time",
        "datePosted": "22 hours ago",
        "salaryRange": "",
        "jobProviders": [
          {
            "jobProvider": "SaluteMyJob",
            "url": "https://salutemyjob.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "WANE Jobs",
            "url": "https://jobs.wane.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "KHON2 Jobs",
            "url": "https://jobs.khon2.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "KNWA &amp; FOX24 Jobs",
            "url": "https://jobs.nwahomepage.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "My Stateline Jobs",
            "url": "https://jobs.mystateline.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "WDTN Jobs",
            "url": "https://jobs.wdtn.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "WAVY Jobs",
            "url": "https://jobs.wavy.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "KSNT Jobs",
            "url": "https://jobs.ksnt.com/jobs/web-developer-great-falls-virginia/1210822821-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          }
        ]
      },
      {
        "id": "VyxlLGIsICxELGUsdixlLGwsbyxwLGUscixSLG8sYixlLHIsdCwgLEgsYSxsLGYsTCxhLGssZSwgLE0=",
        "title": "Web Developer",
        "company": "Robert Half",
        "description": "Description\n\nRobert Half has an exciting opportunity for a talented Web Developer with a thorough knowledge of design software and user experience to join a growing company...\n\nDo you have an aptitude for coding, a deep understanding of enterprise systems, and a creative side? Then contact us today about this fulfilling Web Developer role.\n\nApply today for immediate consideration!\n\nHow You Will Make An Impact\n\nWork with leadership and others to find the right solutions.\n\nUse creative approaches to drive and code solutions.\n\nIdentify business needs and ensure solutions align with the company goals.\n\nWork through complex business practices to establish simple solutions using best of breed tools.\n\nWork with key partners to punctually deliver tested and reusable code in a quickly changing environment.\n\nRequirements\n\nJavascript\n\nAngular or React\n\nNode.JS\n\nAWS\n\nTechnology Doesn't Change the World, People Do.®\n\nRobert Half is the world’s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies. We offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles.\n\nRobert Half works to put you in the best position to succeed. We provide access to top jobs, competitive compensation and benefits, and free online training. Stay on top of every opportunity - whenever you choose - even on the go.\n\nAll applicants applying for U.S. job openings must be legally authorized to work in the United States. Benefits are available to contract/temporary professionals, including medical, vision, dental, and life and disability insurance. Hired contract/temporary professionals are also eligible to enroll in our company 401(k) plan. Visit\n\n© 2024 Robert Half. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking “Apply Now,” you’re agreeing to",
        "image": "https://www.gstatic.com/onebox/jobs/ic_dental_coverage.png",
        "location": "Lake Mary, FL",
        "employmentType": "Contractor",
        "datePosted": "9 hours ago",
        "salaryRange": "",
        "jobProviders": [
          {
            "jobProvider": "LinkedIn",
            "url": "https://www.linkedin.com/jobs/view/web-developer-at-robert-half-3808582101?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          }
        ]
      },
      {
        "id": "VyxlLGIsICxELGUsdixlLGwsbyxwLGUscixHLGUsbyxyLGcsZSx0LG8sdyxuLCAsVSxuLGksdixlLHI=",
        "title": "Web Developer",
        "company": "Georgetown University",
        "description": "Web Developer\n\nGeorgetown University in Qatar (GU-Q) is dedicated to fulfilling Georgetown University's mission of promoting intellectual, ethical and spiritual understanding through serious and sustained discourse among people of different faiths, cultures, and beliefs. Embodying this spirit of the University, Georgetown's Qatar campus undertakes education, research, and service in order to... advance knowledge and provide students and the community with a holistic educational experience that produces global citizens committed to the service of humankind. We demonstrate the values of Georgetown University; seek to build upon the world-class reputation of the Edmund A. Walsh School of Foreign Service; and work with our partner, Qatar Foundation, in its endeavors to achieve the Qatar National Vision 2030.\n\nRequirements\n\nThe person in this position will manage website development, ensure design standards, and update content regularly.\n\nNote: As this vacancy is based in Doha and offers no relocation assistance, GU-Q is looking only for locally-based candidates who have a valid Qatar residence permit. The position is full-time, one-year (renewable).\n\nKey Accountabilities\n• Manage the technical development and programming of the website, encompassing code specifications, design, application layer programming for modular content replication through CMS, and maintain a comprehensive understanding to supervise all associated design changes, while also responsible for writing standards documentation.\n• Develop standard-compliant, robust, and reusable websites and applications for GU-Q, including Qatar campus website design and programming, content and graphics development including streaming video, animations, and related imagery.\n• Oversee the continuous content updates of the website on a timely basis, including editing and proofreading, compliance with current and future web accessibility and design standards, monitoring questions received on the site, and perform general site maintenance.\n• Train all website contributors across campus and work directly with all necessary parties for a superb web and digital experience for all GU-Q audiences, collaborating on the technical development and programming of supplementary websites for university-related functions, projects, and events.\n\nKey Activities\n• Manage all technical aspects of the GU-Q Website, running on WordPress CMS (content management system), including:\n- Use blocks and the Gutenberg editor to create and organize content, enhance functionality with custom post types, short codes, and widgets.\n\n- Manage the website's visual aspect through themes, customize layouts with page builders, and adjust details using custom fields.\n\n- Add diverse features using plugins, and integrate external services through APIs (including Facebook, Twitter, Instagram, Vimeo, YouTube, Google maps and others).\n\n- Customize menus and utilize taxonomies like categories and tags to organize site content and enhance user experience.\n\n- Manage user roles and permissions, and run multiple WordPress sites using the WordPress multisite features.\n\n- Ensure the website is optimized for search engines and responsive to mobile and tablet devices for better user engagement.\n\n- Provide training for users with limited content creation permissions, focusing on how to effectively use WordPress features and tools for their specific roles and needs.\n• Provide web expertise and advice to stakeholders and users on best practices to ensure the success of all web projects, in areas like usability, information architecture, accessibility, and 508 compliances.\n• Create and maintain documentation for all digital footprints affiliated with GU-Q.\n• Guide development from external sources for technologies used at the University, through documentation and the University Development Framework.\n• Maintain awareness and acquire knowledge of the latest technology trends and challenges in the web application development arena.\n• Ensure compliance with institutional and federal accessibility standards, including WCAG and ADA guidelines, and achieve cross-browser compatibility by utilizing advanced skills in modern HTML design and coding, alongside a strong foundation in standards-compliant web development.\n• Develop dynamic, server-side functionality using PHP and modern web development frameworks, ensuring robust and scalable web page construction in a WordPress environment.\n• Manage content reviews, updates, and publishing to ensure the Arabic language website stays within a 24-hour synchronization of the English site updates. Act as content reviewer and publisher when necessary.\n• Produce technical reports, work plans, and document systems related to the management of the websites' infrastructure.\n• Other similar duties as assigned.\n\nKnowledge and Skills\n• Knowledge of web development and design, proficiency in CSS, JavaScript, HTML5, modern front-end frameworks, and applying UX design principles to enhance user interaction and engagement.\n• Strong understanding of PHP and knowledge of web languages like Python.\n• Sound knowledge of operating systems, network and internet technologies, web services, open standards, database systems, and information security.\n• Advanced knowledge of WordPress CMS, including plugin and theme development, standards-based web page construction, and modern WordPress development practices.\n• Ability to provide around-the-clock technical support, 24 hours a day, 7 days a week managing outage management supports in adherence to SLAs.\n• Familiarity with software development tools and analysis, including Linux, version control systems like Git, continuous development and integration, application automation, testing, and web analysis tools like Google Analytics and Tag Manager.\n• Ability to operate across Windows and Mac OS platforms with demonstrated knowledge of robust security measures for data protection and system integrity.\n• Knowledge of diverse development areas, including Salesforce and Apex application development, mobile application development techniques, and adapting large-scale print publications for web applications.\n• Expert knowledge of Microsoft Office Suite.\n• Strong problem-solving and analytical skills, meticulous attention to detail, and the ability to make informed, proactive decisions.\n• Strong project management skills.\n• Demonstrated proficiency in creating detailed documentation.\n• Outstanding interpersonal and communication skills, with the ability to work with diverse individuals across various cultural and institutional environments.\n• Ability to handle multiple tasks concurrently and independently.\n\nQualifications\n• Bachelor's degree, preferably in a relevant program such as computer science, communications, or business information systems. Master's degree preferred.\n• Relevant industry-leading certifications in web development and design, JavaScript, HTML5, CSS, UX Design, and Front-end web development.\n\nExperience\n• 5+ years of relevant work experience.\n• Sound experience with at least one enterprise web content management system, WordPress preferred.\n• Experience with dynamic server-based Web page coding &amp; functionality, including PHP, Node.js, and Python.\n• Experience with using Linux servers, UX design, and Git-based version control software.\n• Extensive experience with front-end web languages including CSS, JavaScript, HTML5, designing websites to meet institutional requirements, federal accessibility standards, and cross-browser compatibility, as well as developing web-based database applications.\n• Related experience in a university or other educational/research institution is preferred.\n\nCurrent Georgetown Employees:\n\nIf you currently work at Georgetown University, please exit this website and login to GMS (gms.georgetown.edu) using your Net ID and password. Then select the Career worklet on your GMS Home dashboard to view Jobs at Georgetown.\n\nSubmission Guidelines:\n\nPlease note that in order to be considered an applicant for any position at Georgetown University in Qatar, you must submit a resume/CV for each position of interest. Documents are not kept on file for future positions.\n\nNeed Assistance:\n\nNeed some assistance with the application process? Contact us at guqhr@georgetown.edu.\n\nEEO Statement:\n\nGeorgetown University is an Equal Opportunity/Affirmative Action Employer fully dedicated to achieving a diverse faculty and staff. All qualified applicants are encouraged to apply and will receive consideration for employment without regard to race, color, religion, national origin, age, sex (including pregnancy, gender identity and expression, and sexual orientation), disability status, protected veteran status, or any other characteristic protected by law.\n\nBenefits:\n\nGeorgetown University offers a wide variety of comprehensive and competitive benefits. Benefits packages include comprehensive health, dental and vision plans, disability and life insurance coverage, retirement savings programs, tuition assistance, voluntary insurance options (including group legal, accident, and critical illness), and much more. Whatever your need, the Office of Faculty and Staff Benefits will be standing by to support you. You can learn more about the benefits offered to eligible faculty and staff at https://benefits.georgetown.edu or view the online interactive benefits guide for more information.\n\nTo apply, visit https://georgetown.wd1.myworkdayjobs.com/en-US/Georgetown_Qatar_Careers/job/Qatar/Web-Developer_JR16897\n\nCopyright ©2022 Jobelephant.com Inc. All rights reserved.\n\nPosted by the FREE value-added recruitment advertising agency\njeid-2b7636883383624787595ebe1b54d3d6",
        "image": "https://www.gstatic.com/onebox/jobs/ic_dental_coverage.png",
        "location": "Washington, DC",
        "employmentType": "Full-time",
        "datePosted": "2 days ago",
        "salaryRange": "",
        "jobProviders": [
          {
            "jobProvider": "Inside Higher Ed Careers",
            "url": "https://careers.insidehighered.com/job/3064855/web-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "Talent.com",
            "url": "https://www.talent.com/view?id=a4ebf84fb4b9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          },
          {
            "jobProvider": "BeBee",
            "url": "https://us.bebee.com/job/20240118-d44ae558f0d986873e95589e299bc2bd?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
          }
        ]
      }
    ],
    "index": 0,
    "jobCount": 10,
    "hasError": false,
    "errors": []
  }